src/main/resources/xml/accommodationSalesComponentServicePort/updateTravelComponentComments/updateTravelComponentComments.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.service.resmanagement.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ejb:updateTravelComponentComments>
         <!--Optional:-->
         <arg0>
            <!--Optional:-->
            <travelPlanSegmentId>?</travelPlanSegmentId>
            <!--Optional:-->
            <travelComponentGroupingId>?</travelComponentGroupingId>
            <!--Zero or more repetitions:-->
            <codedComments>
               <!--Optional:-->
               <auditDetail>
                  <!--Optional:-->
                  <createdBy>?</createdBy>
                  <!--Optional:-->
                  <createdDate>?</createdDate>
                  <!--Optional:-->
                  <updatedBy>?</updatedBy>
                  <!--Optional:-->
                  <updatedDate>?</updatedDate>
                  <!--Optional:-->
                  <status>?</status>
               </auditDetail>
               <!--Optional:-->
               <code>?</code>
               <!--Optional:-->
               <description>?</description>
               <id>?</id>
               <!--Optional:-->
               <profileType>?</profileType>
               <!--Zero or more repetitions:-->
               <routings>
                  <!--Optional:-->
                  <name>?</name>
               </routings>
               <selectable>?</selectable>
               <!--Optional:-->
               <type>?</type>
            </codedComments>
            <!--Zero or more repetitions:-->
            <comments>
               <!--Optional:-->
               <auditDetail>
                  <!--Optional:-->
                  <createdBy>?</createdBy>
                  <!--Optional:-->
                  <createdDate>?</createdDate>
                  <!--Optional:-->
                  <updatedBy>?</updatedBy>
                  <!--Optional:-->
                  <updatedDate>?</updatedDate>
                  <!--Optional:-->
                  <status>?</status>
               </auditDetail>
               <!--Optional:-->
               <commentText>?</commentText>
               <default>?</default>
               <!--Optional:-->
               <from>?</from>
               <!--Zero or more repetitions:-->
               <routings>
                  <!--Optional:-->
                  <name>?</name>
               </routings>
               <!--Optional:-->
               <to>?</to>
            </comments>
            <!--Optional:-->
            <externalReferenceDetail>
               <!--Optional:-->
               <externalReferenceType>?</externalReferenceType>
               <!--Optional:-->
               <externalReferenceCode>?</externalReferenceCode>
               <!--Optional:-->
               <externalReferenceNumber>?</externalReferenceNumber>
               <!--Optional:-->
               <externalReferenceSource>?</externalReferenceSource>
            </externalReferenceDetail>
         </arg0>
         <!--Optional:-->
         <arg1>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </arg1>
      </ejb:updateTravelComponentComments>
   </soapenv:Body>
</soapenv:Envelope>
